package com.standre1974;

/*
Створити двомірний ступінчатий масив випадкових чисел розміру NxM*, де:

N - кількість рядків (вводимо з консолі);
M - максимальна кількість елементів в рядку (також вводимо з консолі). Для кожного рядка кількість елементів має бути випадковим числом M* в діапазоні 0 <= M* < M.
Створити наступні методи для роботи з масивом:

відсортувати парні рядки за зростанням, а непарні за спаданням;
обчислити суму всіх елементів двовимірного ступінчастого масива;
знайти мінімальний елементи для кожного рядка (результат має бути масивом) та мінімальний елемент серед усіх елементів (абсолютний мінімум)
якщо можливо, то поділити всі елементи ступінчатого масиву на абсолютний мінімум націло

 */

public class Hw12 {
}
